Revit 2027 API
FabricAreaFailures Properties
The BuiltInFailures.FabricAreaFailures type exposes the following members.
Properties
Name | Description
FabricAreaLapSplicesIncorrect |  Fabric Area lap splice is incorrect.
FabricAreaOutSideOfHost |  Fabric Area is sketched completely outside of its host.
Top
See Also
Reference
BuiltInFailures.FabricAreaFailures Class
Autodesk.Revit.DB Namespace